/*=================================
■■■ 연산자(Operator ■■■
- 비트 단위 연산자
=================================*/

public class Test022
{
	public static void main(String[] args)
	{
		int a=10, b=-10;

		System.out.printf("-a : %d%n", ~a);   // ~: bitnot
		System.out.printf("-b : %d%n", ~b);

	}
}

/*실행결과
-a : -11
-b : 9
계속하려면 아무 키나 누르십시오 . . .
*/


/*
a = 10였던 것을 ~ 썼더니 왜 -11이 됐느냐?
-> 00001010  -> ~a -> 11110101 -> -11 
					+ 00001011 -> 11
					  ---------
					 100000000 -> 0

b = -10 -> ????????? ->

           00001010 -> 10
		   11110101
		 +        1
		 ----------
		   11110110 -> ~b -> 00001001 -> 9

*/